*&---------------------------------------------------------------------*
* Program ID  : ZCMRK400
* Title       : [CM]학생파일 일괄등록 및 체크
* Created By  : J.B
* Created On  : 2024.10.08
* Frequency   :
* Category    :
* Description :
*&---------------------------------------------------------------------*
*&
*&
*&---------------------------------------------------------------------*
REPORT  zcmrk400 NO STANDARD PAGE HEADING
                 MESSAGE-ID zcm01 .
*---------------------------------------------------------------------*
* INCLUDE                                                             *
*---------------------------------------------------------------------*
INCLUDE zcmcvc000 .      " Global 공통변수
INCLUDE mzcmrk400c01.
INCLUDE mzcmrk400top.
INCLUDE mzcmrk400sel.
INCLUDE mzcmrk400f01.
INCLUDE mzcmrk400o01.
INCLUDE mzcmrk400i01.

*----------------------------------------------------------------------*
INITIALIZATION.
*----------------------------------------------------------------------*
* 학년도/학기 초기값
  PERFORM set_timelimits_info.
  PERFORM get_user_authorg.

*----------------------------------------------------------------------*
START-OF-SELECTION.
*----------------------------------------------------------------------*
  PERFORM get_data_init_info .
  PERFORM get_data_select .

*----------------------------------------------------------------------*
END-OF-SELECTION.
*----------------------------------------------------------------------*
  CALL SCREEN 100 .
