*&---------------------------------------------------------------------*
*&  Include           ZTEST0320_PAI
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*&      Module  EXIT  INPUT
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
MODULE exit INPUT.
  LEAVE TO SCREEN 0.
ENDMODULE.                 " EXIT  INPUT
*&---------------------------------------------------------------------*
*&      Module  USER_COMMAND_0100  INPUT
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
MODULE user_command_0100 INPUT.
  CASE ok_code.
    WHEN 'REFRESH'.  PERFORM get_data.  "
    WHEN 'STAT'.     PERFORM set_stats.  "잔여횟수
    WHEN 'STAT2'.    PERFORM set_stats2. "점검통계
    WHEN 'ADD1'.     PERFORM set_xmark.  "재이수(1회) (1:1)
    WHEN 'ADD2'.     PERFORM set_xmark2. "재이수 강제연장 (1:N)
  ENDCASE.
ENDMODULE.                 " USER_COMMAND_0100  INPUT
